In [ ]:
import pandas as pd
from datetime import datetime, timedelta
import sqlalchemy as sal
from sqlalchemy.engine import URL
import plotly.express as px

In [2]:
DRIVER_NAME = 'ODBC Driver 17 for SQL Server'
SERVER_NAME = 'SRVSQLC03'
DATABASE_NAME = 'UPME_STA'
USER = 'USER_ETL_DWH_STA'
PASSWORD = 'D42C06A38AAD8067BE1C9640A5257666'

connection_url = URL.create(
    "mssql+pyodbc",
    username=USER,
    password=PASSWORD,
    host=SERVER_NAME,
    port=1433,
    database=DATABASE_NAME,
    query={
        "driver": DRIVER_NAME
    },
)

try:
    engine = sal.create_engine(connection_url)
    conn = engine.connect()
    print("Conexion exitosa")
except Exception as ex:
    print("No se pudo conectar a la base de datos")
    print(ex)

Conexion exitosa

In [4]:
df_enficc = pd.read_sql("""SELECT date, value FROM dbo.daily_entity t1
WHERE id = 118
AND date >= '2010-01-01';""", conn)
# order by date
df_enficc = df_enficc.sort_values(by='date').reset_index(drop=True)
# rename value column
df_enficc.rename(columns={'value': 'enficc'}, inplace=True)
df_enficc.head()

         date       enficc
0  2010-01-01  178824048.0
1  2010-01-02  178824048.0
2  2010-01-03  178824048.0
3  2010-01-04  178824048.0
4  2010-01-05  178824048.0

In [5]:
df_demanda = pd.read_sql("""SELECT * FROM dbo.hourly_entity t1
WHERE id = 4
AND date >= '2010-01-01';""", conn)
# order by date
df_demanda = df_demanda.sort_values(by='date')
# set date index
df_demanda = df_demanda.set_index('date')
# drop id column
df_demanda = df_demanda.drop('id', axis=1)
df_demanda["demanda_comercial"] = df_demanda.sum(
    axis=1, numeric_only=True
)
df_demanda = df_demanda[["demanda_comercial"]].reset_index()
df_demanda.head()

         date  demanda_comercial
0  2010-01-01        115440933.5
1  2010-01-02        127698274.5
2  2010-01-03        123654810.5
3  2010-01-04        145964633.5
4  2010-01-05        152148028.5

In [6]:
df_oef = pd.read_sql("""SELECT date, SUM(value) as oef FROM dbo.daily_entity t1
WHERE id = 132
AND date >= '2010-01-01'
GROUP BY date;""", conn)
# order by date
df_oef = df_oef.sort_values(by='date').reset_index(drop=True)
df_oef.head()

         date           oef
0  2010-01-01  1.197586e+08
1  2010-01-02  1.315751e+08
2  2010-01-03  1.272778e+08
3  2010-01-04  1.476147e+08
4  2010-01-05  1.521460e+08

In [7]:
df = pd.merge(df_enficc, df_oef, on="date")
df = pd.merge(df, df_demanda, on="date")
df['demanda_comercial'] = df['demanda_comercial'].fillna(0)
df['enficc'] = df['enficc'].fillna(0)
df['oef'] = df['oef'].fillna(0)
df['demanda_comercial'] = df['demanda_comercial'] / 1000000
df['enficc'] = df['enficc'] / 1000000
df['oef'] = df['oef'] / 1000000

df.head()

         date      enficc         oef  demanda_comercial
0  2010-01-01  178.824048  119.758573         115.440933
1  2010-01-02  178.824048  131.575135         127.698274
2  2010-01-03  178.824048  127.277800         123.654810
3  2010-01-04  178.824048  147.614725         145.964633
4  2010-01-05  178.824048  152.146045         152.148029

In [8]:
# resample df by month
import pandas as pd
df = df.set_index('date')
df.index = pd.to_datetime(df.index)
df = df.resample('M').mean()
df.head()

                enficc         oef  demanda_comercial
date
2010-01-31  178.824048  150.824378         148.960108
2010-02-28  178.824048  159.207604         157.560910
2010-03-31  178.824048  158.029521         157.700503
2010-04-30  178.824048  159.389644         153.593789
2010-05-31  178.824048  161.090067         154.350038

In [9]:
df['relacion_demnda_oef'] = df['demanda_comercial']/df['oef']
df['relacion_demnda_enficc'] = df['demanda_comercial']/df['enficc']
df.head()

,enficc,oef,demanda_comercial,relacion_demnda_oef,relacion_demnda_enficc
date,,,,,
2010-01-31,178.824048,150.824378,148.960108,0.987639,0.832998
2010-02-28,178.824048,159.207604,157.560910,0.989657,0.881095
2010-03-31,178.824048,158.029521,157.700503,0.997918,0.881875
2010-04-30,178.824048,159.389644,153.593789,0.963637,0.858910
2010-05-31,178.824048,161.090067,154.350038,0.958160,0.863139

In [11]:
df['relacion_demnda_oef'].to_list()

[0.9876394629668174,
 0.9896569428298689,
 0.9979179957567316,
 0.9636371945498801,
 0.9581598726082712,
 0.9545584983347376,
 0.944022802358903,
 0.9578234032878413,
 0.9498331381164506,
 0.9600786456632823,
 0.9574128212519336,
 0.8692081375551012,
 0.8657508985802489,
 0.8576143147786207,
 0.8759567330832827,
 0.8349971747799948,
 0.8462291332080709,
 0.858636307065182,
 0.8419672353903989,
 0.8661146493848296,
 0.8707693681757903,
 nan,
 nan,
 nan,
 0.8290828554363088,
 0.8240832200594806,
 0.8451220953757018,
 0.8132046689740055,
 0.8336880483159598,
 0.8522517658574151,
 0.8524397382129398,
 0.8435602416113316,
 0.8651297118293511,
 0.8368512959340225,
 0.8559662942517485,
 0.8350652714289616,
 0.8589130939426101,
 0.8362418344716682,
 0.8346432867380499,
 0.8729799796767375,
 0.8562991333483279,
 0.8394186424185937,
 0.8531414708252187,
 0.8317370340420775,
 0.8303813571585253,
 0.8328686414830394,
 0.8285701842073159,
 0.9638549892253379,
 0.9778287513546388,
 0.9619571595161582,
 0.9585395176016719,
 0.9600212887776642,
 0.9558525605637624,
 0.9511945192517028,
 0.9501021637402624,
 0.9475125004035304,
 0.9472597649228431,
 0.9371341071951494,
 0.9370852306278603,
 0.9541544627045909,
 nan,
 nan,
 nan,
 nan,
 nan,
 nan,
 0.9387463118031051,
 0.9476224778898684,
 0.9627562822799296,
 0.955672560171682,
 0.9302362024871846,
 0.948284179916216,
 0.9546182820792729,
 0.9359735134420887,
 0.92783738113795,
 0.8922052900061599,
 0.8931599605768488,
 0.8742902397051951,
 0.8566910257184532,
 0.8708137382482509,
 0.8409244303178909,
 0.8361021968744577,
 0.8214134471500967,
 0.8760995396489377,
 0.8713935010645745,
 0.8724644051214073,
 0.8658817183982203,
 0.8648593986196563,
 0.8521054198534306,
 0.8395621907112358,
 0.8400761984375038,
 0.832839598725649,
 0.8157350383094478,
 0.8516814463701871,
 0.8347155331839091,
 0.8576996368194006,
 0.859850293083116,
 0.8396635060888201,
 0.8814937610813267,
 0.8374304766367401,
 0.8317596531435887,
 0.8378950760443752,
 0.8404205659438884,
 0.8373341232744071,
 0.8178769858398238,
 0.8568626997756407,
 0.8520054415001217,
 0.8650172168355152,
 0.9000555651419112,
 0.8749038089298884,
 0.9009194151616182,
 0.8714366937539231,
 0.868509311231054,
 0.8597480837188332,
 0.8577803928244525,
 0.8896060537130838,
 0.867067901550473,
 0.8759994628267911,
 0.8700686548661192,
 0.9556200301621322,
 0.9573403763037095,
 0.9450696932699453,
 0.9142997326977718,
 0.7917312591352538,
 0.833125192998966,
 0.8295507592689674,
 0.8526148738814588,
 0.8672988618426734,
 0.8396228308562956,
 0.8767160870876538,
 0.8957835273419004,
 0.9009187268070012,
 0.8783871022661492,
 0.8445872822171292,
 0.8687425942953552,
 0.8609326862218861,
 0.8285807187172983,
 0.8469534449159445,
 0.882707670154726,
 0.8660963036065282,
 0.8953010853982704,
 0.921373147150227,
 0.8902636954548878,
 0.901064114412004,
 0.883794332227005,
 0.873162122571916,
 0.8935731382733315,
 0.8868358571289288,
 0.8935985215145086,
 0.8646764166445832,
 0.8935401353759627,
 0.8856934220390085,
 0.8678141499311465,
 0.8847897591446348,
 0.8777110195974879,
 0.885174205083196,
 0.8974886001352138,
 0.8827783453174698,
 0.8553038279815913,
 0.8440308743676043,
 0.8761978344683728,
 0.8595029110284929,
 0.8731877702032872,
 0.88756230241071,
 0.9282318660191647,
 0.9111784990630342,
 0.901610567174268,
 0.9516439807205126,
 0.9735585414139025,
 0.9484968362472395,
 0.9954600165233534,
 0.9569391357377701,
 0.9409413163327491,
 0.8975083633374703,
 0.9222022498981315,
 0.9611396477226876,
 0.9757232746997021,
 0.9784195191351786,
 0.9457783277323486,
 0.9346664265932492,
 0.9337569063613668,
 0.8928842211424914,
 0.9046644016326295,
 0.8973499631932738,
 0.9046808356710895]